import pandas as pd


#---------------------------------------------#

#Логин и пароль управляющего
logA =("12345")
passA = ("55555")


#Логин и пароль министерства
logM = ("55555")
passM = ("12345")


vib = input ("Выберите Вход или Регистрация(v/r): ")

if vib == ("v"):
    
    logV = input ("Введите логин: ")
    passV = input ("Введите пароль: ")


#Проверка админок
#------------------------------------------# 
    
    if logV == logA:
        if passV == passA:
            print ("Hello Admin")
            
        else:
        
            print("Ошибка при вводе")
#------------------------------------------#        
    
    elif logV == logM:
        if passV == passM:
            print ("Hello Min")    
             
        else:
        
            print("Ошибка при вводе")
#------------------------------------------#     
    else:
        
            print("Ошибка при вводе")
#------------------------------------------#


            

#Создание и заполнение таблицы для пользовательских логинов и паролей

if vib == ("r"):
    
    test = True

    while test:
        
        logR = input ("Введите логин: ")
        passR = input ("Введите пароль: ")

        df2 = pd.DataFrame(
#        [['12345','55555'], 
#    ['54321','55555']],
            [["-----", "-----"]],
    #Название столбцов
            columns = ['Логин','Пароль'])
        
        new_row = {logR, passR}
        df2 = df2.append(new_row, ignore_index=True)
        
        print(df2.head())


    test = True

